RDE_Shock/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 10 0 0 );

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform ( 10 0 0 );
    }
    outlet
    {
        type            zeroGradient;
    }
    innerWall
    {
        type            noSlip;
    }
    outerWall
    {
        type            noSlip;
    }
}


// ************************************************************************* //
